**`teams/nomis/windows_server_2022_jumpserver`** terragrunt plan on `pull_request` event [#845](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["jumpserver.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["prometheus_windows_exporter.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["powershell_core.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.imagebuilder.aws_imagebuilder_component.this["powershell_core.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/powershell-core/0.1.5/1"
        name                  = "powershell_core"
      + supported_os_versions = []
        tags                  = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "NOMIS"
            "branch"                                  = "main"
            "business-unit"                           = "HMPPS"
            "ec2launch-v2-windows-version"            = "1.0.0"
            "github-actor"                            = "robertiansweetman"
            "image-pipeline"                          = "nomis_windows_server_2022_jumpserver"
            "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4"
            "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4"
            "is-production"                           = "true"
            "jumpserver-version"                      = "1.0.13"
            "os-version"                              = "windows server 2022"
            "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "powershell_core-version"                 = "0.1.5"
            "prometheus_windows_exporter-version"     = "1.1.3"
            "release-or-patch"                        = "release"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["jumpserver.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver/1.0.13/1"
        name                  = "jumpserver"
      ~ tags                  = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
      ~ tags_all              = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["powershell_core.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/powershell-core/0.1.5/1"
        name                  = "powershell_core"
      ~ tags                  = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
      ~ tags_all              = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["prometheus_windows_exporter.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheus-windows-exporter/1.1.3/1"
        name                  = "prometheus_windows_exporter"
      ~ tags                  = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
      ~ tags_all              = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2022-jumpserver"
        name         = "nomis_windows_server_2022_jumpserver"
      ~ tags         = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
      ~ tags_all     = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2022-jumpserver" -> (known after apply)
      ~ date_created                     = "2023-01-03T16:26:13.049Z" -> (known after apply)
      + date_last_run                    = (known after apply)
      ~ date_next_run                    = "2023-02-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-01-03T16:26:13.049Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-windows-server-2022-jumpserver" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.3.4" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-3-4" -> (known after apply)
        name                             = "nomis_windows_server_2022_jumpserver"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
      ~ tags_all                         = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.3.4" -> (known after apply)
      ~ date_created     = "2023-01-03T16:26:10.489Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-windows-server-2022-jumpserver/0.3.4" -> (known after apply)
        name             = "nomis_windows_server_2022_jumpserver"
      ~ owner            = "374269020027" -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ parent_image     = (sensitive) # forces replacement
      ~ platform         = "Windows" -> (known after apply)
      ~ tags             = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
      ~ tags_all         = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "0.3.4" -> "0.3.5" # forces replacement
        # (1 unchanged attribute hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (5 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-3-4" -> (known after apply)
      ~ date_created                  = "2023-01-03T16:26:06.748Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2022-jumpserver-0-3-4" -> (known after apply)
      ~ name                          = "nomis_windows_server_2022_jumpserver_0_3_4" -> "nomis_windows_server_2022_jumpserver_0_3_5" # forces replacement
      ~ resource_tags                 = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
      ~ tags                          = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
      ~ tags_all                      = {
          - "github-actor"                            = "robertiansweetman" -> null
          ~ "image-recipe"                            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
          ~ "infrastructure-configuration"            = "nomis_windows_server_2022_jumpserver/0.3.4" -> "nomis_windows_server_2022_jumpserver/0.3.5"
            # (14 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 4 to change, 3 to destroy.

```
